<?php

$basePath = dirname(__DIR__);
$cunliCodes = array();
$cunliJson = json_decode(file_get_contents($basePath . '/map/cunli.json'), true);
foreach($cunliJson['objects']['20210324']['geometries'] AS $cunli) {
    if(empty($cunli['properties']['VILLNAME'])) {
        continue;
    }
    if($cunli['properties']['COUNTYNAME'] !== '臺東縣') {
        $cunli['properties']['COUNTYNAME'] = str_replace('臺', '台', $cunli['properties']['COUNTYNAME']);
    }
    $cunliCodes[$cunli['properties']['COUNTYNAME'] . $cunli['properties']['TOWNNAME'] . $cunli['properties']['VILLNAME']] = $cunli['properties']['VILLCODE'];
}

$result = array();
$cities = array(
    'A' => '台北市',
    'B' => '台中市',
    'C' => '基隆市',
    'D' => '台南市',
    'E' => '高雄市',
    'F' => '新北市',
    'G' => '宜蘭縣',
    'H' => '桃園市',
    'J' => '新竹縣',
    'K' => '苗栗縣',
    'L' => '臺中縣',
    'M' => '南投縣',
    'N' => '彰化縣',
    'P' => '雲林縣',
    'Q' => '嘉義縣',
    'R' => '臺南縣',
    'S' => '高雄縣',
    'T' => '屏東縣',
    'U' => '花蓮縣',
    'V' => '臺東縣',
    'X' => '澎湖縣',
    //'Y' => '陽明山',
    'W' => '金門縣',
    'Z' => '連江縣',
    'I' => '嘉義市',
    'O' => '新竹市',
);

$codeMap = array(
    '台北市大安區羣賢里' => '63000030036',
    '台北市大安區羣英里' => '63000030037',
    '台北市萬華區糖廍里' => '63000070015',
    '台北市大同區文昌里' => '63000060023',
    '台北市南港區舊庄里' => '63000090016',
    '台北市信義區富臺里' => '63000020019',
    '台中市東區富臺里' => '66000020014',
    '台中市西區公舘里' => '66000040009',
    '台中市西區双龍里' => '66000040024',
    '台中市北屯區廍子里' => '66000080013',
    '台中市清水區槺榔里' => '66000120016',
    '台中市沙鹿區犂分里' => '66000130010',
    '台中市外埔區廍子里' => '66000210011',
    '台中市大安區龜売里' => '66000220004',
    '台中市大肚區蔗廍里' => '66000240016',
    '台中市霧峰區丁臺里' => '66000260018',
    '台南市安南區顯宮里' => '67000350034',
    '台南市安南區󻕯南里' => '67000350003',
    '台南市安南區公󻕯里' => '67000350024',
    '台南市安南區𥂁田里' => '67000350019',
    '台南市中西區赤崁里' => '67000370005',
    '台南市鹽水區坔頭港里' => '67000020033',
    '台南市麻豆區晋江里' => '67000070004',
    '台南市麻豆區寮廍里' => '67000070015',
    '台南市官田區南廍里' => '67000100008',
    '台南市七股區𥂁埕里' => '67000150007',
    '台南市新化區山腳里' => '67000180016',
    '台南市新化區𦰡拔里' => '67000180018',
    '台南市山上區玉峯里' => '67000220005',
    '台南市龍崎區石𥕢里' => '67000300008',
    '台南市永康區塩行里' => '67000310010',
    '台南市永康區塩洲里' => '67000310029',
    '台南市永康區塩興里' => '67000310043',
    '高雄市左營區自立里' => '64000030020',
    '高雄市左營區自治里' => '64000030018',
    '高雄市左營區自勉里' => '64000030033',
    '高雄市左營區廍南里' => '64000030028',
    '高雄市左營區廍北里' => '64000030027',
    '高雄市左營區聖北里' => '',
    '高雄市左營區路南里' => '',
    '高雄市三民區港北里' => '',
    '高雄市鳥松區坔埔里' => '64000180004',
    '高雄市岡山區臺上里' => '64000190020',
    '高雄市岡山區爲隨里' => '64000190031',
    '高雄市梓官區茄典里' => '64000290014',
    '高雄市阿蓮區峰山里' => '64000230003',
    '高雄市湖內區公舘里' => '64000250004',
    '高雄市內門區內豐里' => '64000350008',
    '高雄市那瑪夏區達卡努瓦' => '64000380001',
    '新北市新店區五峰里' => '65000060041',
    '新北市石碇區碧山里' => '',
    '新北市坪林區石𥕢里' => '65000200004',
    '新北市板橋區公館里' => '65000010021',
    '新北市三峽區永館里' => '65000090006',
    '新北市樹林區󿾵寮里' => '65000070007',
    '新北市樹林區西山里' => '65000070023',
    '新北市中和區瓦󼍕里' => '65000030017',
    '新北市中和區灰󼍕里' => '65000030054',
    '新北市土城區峰廷里' => '65000130017',
    '新北市瑞芳區爪峰里' => '65000120007',
    '新北市瑞芳區濓洞里' => '65000120028',
    '新北市瑞芳區濓新里' => '65000120027',
    '新北市萬里區崁脚里' => '65000280008',
    '新北市永和區新廍里' => '65000040045',
    '宜蘭縣羅東鎮新羣里' => '10002020006',
    '宜蘭縣五結鄉錦衆村' => '10002090012',
    '宜蘭縣冬山鄉羣英村' => '10002080017',
    '宜蘭縣大同鄉土場村' => '',
    '桃園市桃園區永和里' => '',
    '桃園市大園區菓林里' => '68000060011',
    '桃園市新屋區槺榔里' => '68000110020',
    '新竹縣竹東鎮上舘里' => '10004020006',
    '新竹縣竹東鎮鷄林里' => '10004020012',
    '新竹縣北埔鄉水磜村' => '10004090004',
    '苗栗縣苑裡鎮山腳里' => '10005020014',
    '苗栗縣苑裡鎮上館里' => '10005020021',
    '苗栗縣三義鄉双湖村' => '10005130002',
    '苗栗縣三義鄉双潭村' => '10005130003',
    '苗栗縣竹南鎮公館里' => '10005040018',
    '南投縣竹山鎮硘󼍕里' => '10008040005',
    '南投縣名間鄉󿾴下村' => '10008060012',
    '彰化縣彰化市下廍里' => '10007010002',
    '彰化縣彰化市南瑤里' => '10007010039',
    '彰化縣彰化市磚磘里' => '10007010030',
    '彰化縣彰化市寶廍里' => '10007010059',
    '彰化縣彰化市臺鳳里' => '10007010071',
    '彰化縣員林市大峰里' => '10007100030',
    '彰化縣線西鄉󻕯仔村' => '10007040004',
    '彰化縣秀水鄉陜西村' => '10007070005',
    '彰化縣埔鹽鄉廍子村' => '10007140003',
    '彰化縣埔鹽鄉瓦磘村' => '10007140010',
    '彰化縣埔心鄉舊館村' => '10007150012',
    '彰化縣埔心鄉南館村' => '10007150013',
    '彰化縣埔心鄉新館村' => '10007150014',
    '彰化縣埔心鄉埤腳村' => '10007150020',
    '彰化縣芳苑鄉頂廍村' => '10007230013',
    '雲林縣斗六市崙峰里' => '10009010018',
    '雲林縣西螺鎮公館里' => '10009040027',
    '雲林縣北港鎮公館里' => '10009060011',
    '雲林縣麥寮鄉瓦󼍕村' => '10009130003',
    '雲林縣臺西鄉臺西村' => '10009160001',
    '雲林縣元長鄉瓦磘村' => '10009170018',
    '雲林縣四湖鄉󿿀子村' => '10009180016',
    '雲林縣四湖鄉󿿀東村' => '10009180021',
    '雲林縣口湖鄉臺子村' => '10009190014',
    '雲林縣水林鄉𣐤埔村' => '10009200021',
    '雲林縣水林鄉󻕯底村' => '10009200022',
    '嘉義縣朴子市双溪里' => '10010020012',
    '嘉義縣民雄鄉豐收村' => '10010050012',
    '嘉義縣民雄鄉雙福村' => '10010050023',
    '嘉義縣東石鄉󻕯港村' => '10010090004',
    '嘉義縣東石鄉󻕯仔村' => '10010090019',
    '嘉義縣鹿草鄉豐稠村' => '10010110005',
    '嘉義縣中埔鄉𥂁舘村' => '10010130002',
    '嘉義縣中埔鄉石硦村' => '10010130014',
    '嘉義縣竹崎鄉文峰村' => '10010140018',
    '嘉義縣梅山鄉双溪村' => '10010150010',
    '嘉義縣梅山鄉瑞峰村' => '10010150015',
    '屏東縣東港鎮下廍里' => '10013030017',
    '屏東縣東港鎮興臺里' => '10013030005',
    '屏東縣萬丹鄉厦南村' => '10013050013',
    '屏東縣萬丹鄉厦北村' => '10013050012',
    '屏東縣里港鄉三廍村' => '10013090012',
    '屏東縣新園鄉瓦󼍕村' => '10013170001',
    '屏東縣林邊鄉崎峰村' => '10013190007',
    '屏東縣南州鄉溪州村' => '10013200001',
    '屏東縣佳冬鄉羗園村' => '10013210010',
    '屏東縣佳冬鄉󻕯豐村' => '10013210012',
    '屏東縣滿州鄉响林村' => '10013240005',
    '屏東縣霧臺鄉霧臺村' => '10013270001',
    '屏東縣瑪家鄉凉山村' => '10013280003',
    '花蓮縣玉里鎮啓模里' => '10015030002',
    '臺東縣關山鎮里壠里' => '10014030005',
    '臺東縣綠島鄉公館村' => '10014110001',
    '臺東縣達仁鄉土坂村' => '10014150002',
    '臺東縣達仁鄉臺坂村' => '10014150001',
    '澎湖縣馬公市新復里' => '',
    '澎湖縣馬公市啓明里' => '10016010005',
    '澎湖縣馬公市嵵裡里' => '10016010031',
    '澎湖縣湖西鄉菓葉村' => '10016020022',
    '連江縣北竿鄉坂里村' => '09007020005',
    '嘉義市西區磚󼍕里' => '10020020018',
    '新竹市北區臺溪里' => '10018020044',
    '新北市三峽區永舘里' => '65000090006',
    '新北市中和區瓦磘里' => '65000030017',
    '新北市中和區灰磘里' => '65000030054',
    '南投縣名間鄉廍下村' => '10008060012',
    '雲林縣斗六市文化里' => '',
    '雲林縣斗南鎮大同里' => '',
    '雲林縣斗南鎮僑真里' => '',
);

$txtPairs = array(
    '　' => '',
    ' ' => '',
);

$trBase = array(
    '&nbsp;' => '',
);

$missing = array();
$skip = array('合計', '其他', '');
$errorPool = array();

$years = array('isa106', 'isa107', 'isa108');
foreach($years AS $year) {
    $rawPath = $basePath . '/raw/' . $year;
    $p = pathinfo($rawPath);
    $y = substr($p['filename'], 3);
    foreach ($cities AS $city => $cityName) {
        $pageFile = "{$rawPath}/{$y}_165-{$city}.html";
        if (file_exists($pageFile)) {
            $page = file_get_contents($pageFile);
            $lines = explode('</tr>', $page);
            $lastLine = array();
            foreach ($lines AS $line) {
                $cols = explode('</td>', $line);
                if (count($cols) !== 13) {
                    continue;
                }
                foreach ($cols AS $k => $v) {
                    $cols[$k] = trim(strip_tags($v));
                }
                if ($cols[2] === '合　計' || $cols[2] === '其　他') {
                    continue;
                }
                if (empty($cols[1])) {
                    $cols[1] = $lastLine[1];
                }
                $cunliKey = $cityName . $cols[1] . $cols[2];
                $cunliKey = strtr($cunliKey, $txtPairs);
                $cunliCode = '';
                if (isset($cunliCodes[$cunliKey])) {
                    $cunliCode = $cunliCodes[$cunliKey];
                } elseif (isset($codeMap[$cunliKey])) {
                    $cunliCode = $codeMap[$cunliKey];
                }
                if (empty($cunliCode)) {
                  if(!isset($errorPool[$cunliKey])) {
                    $errorPool[$cunliKey] = true;
                    echo $cunliKey . "\n";
                  }
                } else {
                    if (!isset($result[$cunliCode])) {
                        $result[$cunliCode] = array();
                    }
                    $result[$cunliCode][$y + 1911] = array(
                        'adm' => intval($cols[3]),
                        'total' => intval($cols[4]),
                        'avg' => floatval($cols[5]),
                        'mid' => intval($cols[6]),
                        'mid1' => intval($cols[7]),
                        'mid3' => intval($cols[8]),
                        'sd' => floatval($cols[9]),
                        'cv' => floatval($cols[10]),
                    );
                }
                $lastLine = $cols;
            }
        }
    }
}

file_put_contents($basePath . '/map/fia_data.json', json_encode($result, JSON_PRETTY_PRINT | JSON_UNESCAPED_UNICODE));