<?php
$basePath = dirname(__DIR__);

$json = json_decode(file_get_contents($basePath . '/map/20190624.json'), true); //212

$code = array(
  '臺北市大安區羣賢里' => '63000030036',
  '臺北市大安區羣英里' => '63000030037',
  '臺北市南港區舊庄里' => '63000090016',
  '臺北市信義區富臺里' => '63000020019',
  '臺中市東區富臺里' => '66000020014',
  '臺中市沙鹿區犂分里' => '66000130010',
  '臺中市大安區龜売里' => '66000220004',
  '臺中市霧峰區丁臺里' => '66000260018',
  '臺南市中西區赤崁里' => '67000370005',
  '臺南市新化區山腳里' => '67000180016',
  '臺南市新化區𦰡拔里' => '67000180018',
  '臺南市龍崎區石𥕢里' => '67000300008',
  '高雄市岡山區臺上里' => '64000190020',
  '高雄市岡山區爲隨里' => '64000190031',
  '高雄市阿蓮區峰山里' => '64000230003',
  '高雄市內門區內豐里' => '64000350008',
  '高雄市那瑪夏區達卡努瓦' => '64000380001',
  '新北市新店區五峰里' => '65000060041',
  '新北市坪林區石𥕢里' => '65000200004',
  '新北市板橋區公館里' => '65000010021',
  '新北市三峽區永館里' => '65000090006',
  '新北市土城區峰廷里' => '65000130017',
  '新北市瑞芳區爪峰里' => '65000120007',
  '新北市瑞芳區濓洞里' => '65000120028',
  '新北市瑞芳區濓新里' => '65000120027',
  '宜蘭縣羅東鎮新羣里' => '10002020006',
  '宜蘭縣五結鄉錦衆村' => '10002090012',
  '宜蘭縣冬山鄉羣英村' => '10002080017',
  '苗栗縣苑裡鎮山腳里' => '10005020014',
  '苗栗縣苑裡鎮上館里' => '10005020021',
  '苗栗縣竹南鎮公館里' => '10005040018',
  '南投縣名間鄉下村' => '10008060012',
  '彰化縣彰化市南瑤里' => '10007010039',
  '彰化縣彰化市臺鳳里' => '10007010071',
  '彰化縣員林市大峰里' => '10007100030',
  '彰化縣秀水鄉陜西村' => '10007070005',
  '彰化縣埔心鄉舊館村' => '10007150012',
  '彰化縣埔心鄉南館村' => '10007150013',
  '彰化縣埔心鄉新館村' => '10007150014',
  '彰化縣埔心鄉埤腳村' => '10007150020',
  '雲林縣斗六市崙峰里' => '10009010018',
  '雲林縣西螺鎮公館里' => '10009040027',
  '雲林縣北港鎮公館里' => '10009060011',
  '雲林縣臺西鄉臺西村' => '10009160001',
  '雲林縣四湖鄉子村' => '10009180016',
  '雲林縣四湖鄉東村' => '10009180021',
  '雲林縣口湖鄉臺子村' => '10009190014',
  '雲林縣水林鄉埔村' => '10009200021',
  '嘉義縣民雄鄉豐收村' => '10010050012',
  '嘉義縣民雄鄉雙福村' => '10010050023',
  '嘉義縣鹿草鄉豐稠村' => '10010110005',
  '嘉義縣竹崎鄉文峰村' => '10010140018',
  '嘉義縣梅山鄉瑞峰村' => '10010150015',
  '屏東縣東港鎮興臺里' => '10013030005',
  '屏東縣林邊鄉崎峰村' => '10013190007',
  '屏東縣南州鄉溪州村' => '10013200001',
  '屏東縣佳冬鄉羗園村' => '10013210010',
  '屏東縣霧臺鄉霧臺村' => '10013270001',
  '花蓮縣玉里鎮啓模里' => '10015030002',
  '臺東縣綠島鄉公館村' => '10014110001',
  '臺東縣達仁鄉臺坂村' => '10014150001',
  '澎湖縣馬公市啓明里' => '10016010005',
  '新竹市北區臺溪里' => '10018020044',
  // '新北市樹林區西山里' => '',
  // '新北市石碇區碧山里' => '',
  // '臺北市大同區文昌里' => '',
  // '高雄市左營區自立里' => '',
  // '高雄市左營區自治里' => '',
  // '高雄市左營區自勉里' => '',
  // '高雄市左營區聖北里' => '',
  // '高雄市左營區路南里' => '',
  // '高雄市三民區港北里' => '',
  // '高雄市梓官區茄典里' => '',
  // '宜蘭縣大同鄉土場村' => '',
  // '桃園市桃園區永和里' => '',
  // '花蓮縣花蓮市民治里' => '',
  // '澎湖縣馬公市新復里' => '',
);
foreach($json['objects']['20190624']['geometries'] AS $cunli) {
  if(!empty($cunli['properties']['VILLNAME'])) {
    $code[$cunli['properties']['COUNTYNAME'] . $cunli['properties']['TOWNNAME'] . $cunli['properties']['VILLNAME']] = $cunli['properties']['VILLCODE'];
  }
}

$fh = fopen($basePath . '/data/csv/2017.csv', 'r');
/*Array
(
    [0] => 縣市
    [1] => 鄉鎮市區
    [2] => 村里
    [3] => 納稅單位
    [4] => 綜合所得總額
    [5] => 平均數
    [6] => 中位數
    [7] => 第一分位數
    [8] => 第三分位數
    [9] => 標準差
    [10] => 變異係數
)
*/
fgetcsv($fh, 2048);
$pool = array();
while($line = fgetcsv($fh, 2048)) {
  switch($line[0]) {
    case '台北市':
    $line[0] = '臺北市';
    break;
    case '台中市':
    $line[0] = '臺中市';
    break;
    case '台南市':
    $line[0] = '臺南市';
    break;
  }
  $key = $line[0] . $line[1] . $line[2];
  if(!isset($code[$key])) {
    $pool[$key] = '';
  } else {
    unset($code[$key]);
  }
}
print_r($pool);
